#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.archive_file.process_expired_keys_archive: Refreshing state...
data.archive_file.get_expired_keys_archive: Refreshing state...
aws_cloudwatch_log_group.process_expired_keys_lambda-log_group: Refreshing state... [id=/aws/lambda/ProcessExpiredKeys]
aws_iam_role.process_expired_keys_lambda_exec_role: Refreshing state... [id=Lambda-ProcessExpiredKeys]
aws_iam_policy.process_expired_keys_lambda_policy: Refreshing state... [id=arn:aws:iam::966864593659:policy/Lambda-ProcessExpiredKeys]
aws_sfn_state_machine.expired_users_state_machine: Refreshing state... [id=arn:aws:states:us-west-2:966864593659:stateMachine:ExpiredUsersKeyRotation]
aws_lambda_function.process_expired_keys_lambda: Refreshing state... [id=ProcessExpiredKeys]
aws_iam_role_policy_attachment.process_expired_keys_lambda_exec_role_attachment: Refreshing state... [id=Lambda-ProcessExpiredKeys-20210122035925894900000001]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.get_expired_keys_lambda-log_group will be created
  + resource "aws_cloudwatch_log_group" "get_expired_keys_lambda-log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/GetExpiredKeys"
      + retention_in_days = 1
    }

  # aws_iam_policy.get_expired_keys_lambda_policy will be created
  + resource "aws_iam_policy" "get_expired_keys_lambda_policy" {
      + arn         = (known after apply)
      + description = "IAM policy for lambda GetExpiredKeys"
      + id          = (known after apply)
      + name        = "Lambda-GetExpiredKeys"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "iam:ListUsers",
                          + "iam:GetUser",
                          + "iam:ListAccessKeys",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.get_expired_keys_sfn_policy will be created
  + resource "aws_iam_policy" "get_expired_keys_sfn_policy" {
      + arn         = (known after apply)
      + description = "IAM policy for step function GetExpiredKeys"
      + id          = (known after apply)
      + name        = "SFN-GetExpiredKeys"
      + path        = "/"
      + policy      = (known after apply)
    }

  # aws_iam_role.get_expired_keys_lambda_exec_role will be created
  + resource "aws_iam_role" "get_expired_keys_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = "123456"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "Lambda-GetExpiredKeys"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.get_expired_keys_sfn_exec_role will be created
  + resource "aws_iam_role" "get_expired_keys_sfn_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                      + Sid       = "123456"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SFN-GetExpiredKeys"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.get_expired_keys_lambda_exec_role_attachment will be created
  + resource "aws_iam_role_policy_attachment" "get_expired_keys_lambda_exec_role_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "Lambda-GetExpiredKeys"
    }

  # aws_iam_role_policy_attachment.get_expired_keys_sfn_exec_role_attachment will be created
  + resource "aws_iam_role_policy_attachment" "get_expired_keys_sfn_exec_role_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SFN-GetExpiredKeys"
    }

  # aws_lambda_function.get_expired_keys_lambda will be created
  + resource "aws_lambda_function" "get_expired_keys_lambda" {
      + arn                            = (known after apply)
      + filename                       = "../lambda_source_code/get_expired_keys.zip"
      + function_name                  = "GetExpiredKeys"
      + handler                        = "get_expired_keys.get_expired_keys"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "ScbGqjdQeMaffzBj4Lz0C9kWz0FkraX4YeiK921YHeM="
      + source_code_size               = (known after apply)
      + timeout                        = 120
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_sfn_state_machine.expired_users_state_machine will be updated in-place
  ~ resource "aws_sfn_state_machine" "expired_users_state_machine" {
        arn           = "arn:aws:states:us-west-2:966864593659:stateMachine:ExpiredUsersKeyRotation"
        creation_date = "2021-01-10T22:31:03Z"
      ~ definition    = jsonencode(
            {
              - Comment = "Access keys rotation workflow"
              - StartAt = "Get Expired Keys"
              - States  = {
                  - Get Expired Keys = {
                      - Branches = [
                          - {
                              - StartAt = "GetUserKeys"
                              - States  = {
                                  - GetUserKeys = {
                                      - End        = true
                                      - Parameters = {
                                          - MaxKeyAge = 1
                                          - UserPath  = "/test_users/"
                                        }
                                      - Resource   = "arn:aws:lambda:us-west-2:966864593659:function:GetExpiredKeys"
                                      - Type       = "Task"
                                    }
                                }
                            },
                          - {
                              - StartAt = "GetServiceAccountsKeys"
                              - States  = {
                                  - GetServiceAccountsKeys = {
                                      - End        = true
                                      - Parameters = {
                                          - MaxKeyAge = 1
                                          - UserPath  = "/service_accounts/"
                                        }
                                      - Resource   = "arn:aws:lambda:us-west-2:966864593659:function:GetExpiredKeys"
                                      - Type       = "Task"
                                    }
                                }
                            },
                        ]
                      - End      = true
                      - Type     = "Parallel"
                    }
                }
            }
        ) -> (known after apply)
        id            = "arn:aws:states:us-west-2:966864593659:stateMachine:ExpiredUsersKeyRotation"
        name          = "ExpiredUsersKeyRotation"
      ~ role_arn      = "arn:aws:iam::966864593659:role/SFN-GetExpiredKeys" -> (known after apply)
        status        = "ACTIVE"
        tags          = {}
    }

Plan: 8 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @doublenns, Action: `pull_request`, Working Directory: `udemy-advanced_serverless_workflow_with_step_functions/terraform`, Workflow: `PR Builder`*